
/***************************************************************************
*                           *  整体结构关系 *                              *
*                                                                          *
*   1.本文介绍了该网络链接类的结构规定，以接口的形式开发，本程序集的       *
*     思想：从作者本人的经验对网络传输的功能逻辑层进行拆分 。              *
*   2.本文共五部分，文件夹内容对应如下：                                   *
*          （1）逻辑结构                                                   *
*          （2）数据传输层                                                 *
*          （3）原始数据的自定义收发规则（用户收发协议）                   *
*          （5）应用层（暴露给外部应用）                                   *
*                                                                          *
****************************************************************************/